Sekiro22/ch32v307vct6-lvgl-watch/User/ui/ch32v307_gc9a01_ui_gen.c
/**
 * @file ch32v307_gc9a01_ui_gen.c
 */

/*********************
 *      INCLUDES
 *********************/

#include "ch32v307_gc9a01_ui_gen.h"

#if defined(LV_USE_XML) && LV_USE_XML
#endif /* LV_USE_XML */

/*********************
 *      DEFINES
 *********************/

/**********************
 *      TYPEDEFS
 **********************/

/**********************
 *  STATIC PROTOTYPES
 **********************/

static void check_font(lv_font_t ** font, const char * name);

/**********************
 *  STATIC VARIABLES
 **********************/

static uint32_t ch32v307_gc9a01_ui_target = CH32V307_GC9A01_UI_TARGET_ALL;

/*----------------
 * Translations
 *----------------*/

#ifndef LV_EDITOR_PREVIEW
    static const char * translation_languages[] = {"en", "de", NULL};
    static const char * translation_tags[] = {"dog", "cat", "house", NULL};
    static const char * translation_texts[] = {
        "This is a dog", "Das ist ein Hund", /* dog */
        "A curious little cat", "Eine neugierige kleine Katze", /* cat */
        "The house is cozy and warm", "Das Haus ist gemütlich und warm", /* house */
    };
#endif

/**********************
 *  GLOBAL VARIABLES
 **********************/

/*--------------------
 *  Permanent screens
 *-------------------*/

/*----------------
 * Fonts
 *----------------*/

lv_font_t * font_data_10;
extern lv_font_t font_data_10_data;
lv_font_t * font_data_12;
extern lv_font_t font_data_12_data;

/*----------------
 * Images
 *----------------*/



/*----------------
 * Global styles
 *----------------*/

/*----------------
 * Subjects
 *----------------*/

/**********************
 *      MACROS
 **********************/

/**********************
 *   GLOBAL FUNCTIONS
 **********************/

void ch32v307_gc9a01_ui_init_gen(const char * asset_path)
{
    /* When running from the editor the theme set from the XML should overwrite this */
#if !defined(LV_EDITOR_PREVIEW)
#if LV_USE_THEME_SIMPLE
    lv_display_t * disp = lv_display_get_default();
    lv_theme_t * th = lv_theme_simple_init(disp);
    lv_display_set_theme(disp, th);
#else
    LV_LOG_WARN("Simple theme is selected in project.xml but LV_USE_THEME_SIMPLE is disabled");
#endif
#endif /*LV_EDITOR_PREVIEW*/


    /*----------------
     * Fonts
     *----------------*/

    /* Targets: any */

    #if CH32V307_GC9A01_UI_CHECK_COMPILE_TARGET(CH32V307_GC9A01_UI_TARGET_ALL)
    if (ch32v307_gc9a01_ui_check_target(CH32V307_GC9A01_UI_TARGET_ALL)) {
        if (!font_data_10) {
            /* font_data_10 */
            /* get font 'font_data_10' from a C array */
            font_data_10 = &font_data_10_data;

        }
        if (!font_data_12) {
            /* font_data_12 */
            /* get font 'font_data_12' from a C array */
            font_data_12 = &font_data_12_data;

        }
    }
    #endif

    /*----------------
     * Images
     *----------------*/



    /*----------------
     * Global styles
     *----------------*/

    /*----------------
     * Subjects
     *----------------*/
    /*----------------
     * Translations
     *----------------*/

    #ifndef LV_EDITOR_PREVIEW
        lv_translation_add_static(translation_languages, translation_tags, translation_texts);
        lv_translation_set_language(translation_languages[0]);
    #endif

#if defined(LV_USE_XML) && LV_USE_XML
    /* Register widgets */

    /* Check all fonts / default if needed. This prevents fonts that are used in one target but
       defined in another from causing assertion failures during rendering of the Preview. */
    check_font(&font_data_10, "font_data_10");
    check_font(&font_data_12, "font_data_12");

    /* Register fonts */
    lv_xml_register_font(NULL, "font_data_10", font_data_10);
    lv_xml_register_font(NULL, "font_data_12", font_data_12);

    /* Register subjects */

    /* Register callbacks */
#endif

    /* Register all the global assets so that they won't be created again when globals.xml is parsed.
     * While running in the editor skip this step to update the preview when the XML changes */
#if defined(LV_USE_XML) && LV_USE_XML && !defined(LV_EDITOR_PREVIEW)
    /* Register images */
#endif

#if !defined(LV_USE_XML) || LV_USE_XML == 0
    /*--------------------
     *  Permanent screens
     *-------------------*/
    /* If XML is enabled it's assumed that the permanent screens are created
     * manually from XML using lv_xml_create() */
#endif
}

void ch32v307_gc9a01_ui_set_target(uint32_t target)
{
    ch32v307_gc9a01_ui_target = target;
}

uint32_t ch32v307_gc9a01_ui_get_target(void)
{
    return ch32v307_gc9a01_ui_target;
}

bool ch32v307_gc9a01_ui_check_target(uint32_t target)
{
    return (ch32v307_gc9a01_ui_target & target) ? true : false;
}

/* Callbacks */

/**********************
 *   STATIC FUNCTIONS
 **********************/

static void check_font(lv_font_t ** font, const char * name)
{
    if (!(*font)) {
        *font = (lv_font_t *)LV_FONT_DEFAULT;
        LV_LOG_WARN("font `%s` was not set. Using `LV_FONT_DEFAULT` instead", name);
    }
}